curriculum-vitae.tex
% Created 2024-01-24 mié 20:29
% Intended LaTeX compiler: pdflatex
\documentclass[10pt,a4paper,ragged2e,withhyper]{altacv}

% Change the page layout if you need to
\geometry{left=1.25cm,right=1.25cm,top=1.5cm,bottom=1.5cm,columnsep=1.2cm}

% Use roboto and lato for fonts
\renewcommand{\familydefault}{\sfdefault}

% Change the colours if you want to
\definecolor{SlateGrey}{HTML}{2E2E2E}
\definecolor{LightGrey}{HTML}{666666}
\definecolor{DarkPastelRed}{HTML}{450808}
\definecolor{PastelRed}{HTML}{8F0D0D}
\definecolor{GoldenEarth}{HTML}{E7D192}
\colorlet{name}{black}
\colorlet{tagline}{PastelRed}
\colorlet{heading}{DarkPastelRed}
\colorlet{headingrule}{GoldenEarth}
\colorlet{subheading}{PastelRed}
\colorlet{accent}{PastelRed}
\colorlet{emphasis}{SlateGrey}
\colorlet{body}{LightGrey}

% Change some fonts, if necessary
\renewcommand{\namefont}{\Huge\rmfamily\bfseries}
\renewcommand{\personalinfofont}{\footnotesize}
\renewcommand{\cvsectionfont}{\LARGE\rmfamily\bfseries}
\renewcommand{\cvsubsectionfont}{\large\bfseries}

% Change the bullets for itemize and rating marker
% for cvskill if you want to
\renewcommand{\itemmarker}{{\small\textbullet}}
\renewcommand{\ratingmarker}{\faCircle}

\usepackage[rm]{roboto}
\usepackage[defaultsans]{lato}
\usepackage{paracol}
\columnratio{0.6} % Set the left/right column width ratio to 6:4.
\usepackage[bottom]{footmisc}
\usepackage[spanish, activeacute, american]{babel}
\author{Carlos Eduardo Martínez Aguilar}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Carlos Eduardo Martínez Aguilar},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.1 (Org mode 9.7)}, 
 pdflang={English}}
\begin{document}

\cvsection{Curriculum Vitae}
\label{sec:org4cd40ff}
\name{Carlos Eduardo Martínez Aguilar}
\photoR{2.8cm}{photo_2020-02-05_23-29-44.jpg}
\tagline{PhD Researcher}

\personalinfo{
  %\homepage{www.aidanscannell.com}
  \email{cmartineza@ciencias.unam.mx}
  \phone{+52 5527200857}
  \location{CDMX, MX}
  \github{buddharta}
  %\linkedin{aidan-scannell-82522789/}
  \dob{14 de Julio 1992}
}
\makecvheader


\cvsection{Educación y Experiencia}
\label{sec:org2638204}
\begin{paracol}{2}
\begin{quote}
Soy un estudiante de doctorado en matemáticas interesado en sistemas dinámicos holomorfos y sus conexiones con análisis complejo y geometría compleja además de los aspectos computacionales de dichas teorías y la matemática en general. Actualmente me encuentro bajo la tutela del doctor Alberto Verjovsky Solá.
\end{quote}

\cvsubsection{Experiencia}
\cvevent{Estudiante de doctorado y asistente de investigador}{ UNAM}{ Agosto 2020 -- Presente}{ CDMX-Cuernavaca, MX}

Me ecuentro investigando las relaciones entre el análisis complejo clásico y la teoría de variedades analíticas, específicamente en el caso que dichas variedades analíticas sean hojas de foliaciones en variedades holomorfas complejas compactas y en la mayor parte de los casos Kähler.

\cvtag{Geometría compleja}
\cvtag{Análisis complejo}
\cvtag{Sistemas dinámicos}
\cvtag{Foliaciones}
\cvtag{Geometría Kähler}

\par\divider
\cvevent{Asistente de profesor}{ UNAM}{ Sept 2015 -- presente}{ CDMX, MX}

Además de mis estudios en matemáticas he impartido las siguientes clases como asistente de profesor en licenciatura y posgrado 
\begin{itemize}
\item Análisis funcional (IIMAS - Posgrado).
\item Álgebra Superior I (Facultad de ciencias - Licenciatura).
\item Álgebra Superior II (Facultad de ciencias - Licenciatura).
\item Variable Compleja I (Facultad de ciencias - Licenciatura).
\item Ecuaciones Diferenciales Ordinarias I (Facultad de ciencias - Licenciatura).
\end{itemize}

\cvtag{Comunicación}
\cvtag{Enseñanza}



\divider
\cvsection{Actividades Académicas}

\cvsubsection{Publicaciones}
\cvsubsubsection{Artículos}
\begin{itemize}
\item \href{https://arxiv.org/abs/2111.04846}{Errett Bishop theorems on Complex Analytic Sets: Chow's Theorem Revisited, and Foliations of Compact Leaves on Kähler Manifolds (arxiv)}
\end{itemize}

\divider
\cvsubsection{Talleres Escuelas y Seminarios}

\cvevent{Escuela de Nudos y 3-variedades. Guanajuato}{ Guanajuato. Centro de Investigación en Matemáticas A.C.}{ Diciembre de 2014, MX}{}

\par\divider

\cvevent{Encuentro de Geometría Algebraica. Guanajuato}{ Guanajuato. Centro de Investigación en Matemáticas A.C.}{ Mayo de 2015, MX}{}

\par\divider

\cvevent{XIII Escuela de Verano en Matemáticas. Unidad Cuernavaca del Instituto de Matemáticas}{ UNAM}{ Julio de 2016., MX}{}

\par\divider

\cvevent{Workshop on Kleinian groups and related topics. Unidad Cuernavaca del Instituto de Matemáticas}{ UNAM}{ Agosto de 2016., MX}{}

\cvsubsection{Certificados y diplomas}

\cvevent{Introduction to Programming with MATLAB}{ Vanderbilt University}{ Octubre 2020}{}

\par\divider

\cvevent{Programación en Python}{ Pilares CDMX}{ Diciembre 2023}{}

\switchcolumn

\cvsubsection{Habilidades y tecnologías}
\cvtag{Python}
\cvtag{TensorFlow}
\cvtag{SymPy}
\cvtag{NumPy}
\cvtag{SciPy}
\cvtag{Matplotlib}

\divider

\cvtag{Java}
\cvtag{C y C++}
\cvtag{MATLAB}
\cvtag{Haskell}

\divider

\cvtag{GNU/Linux}
\cvtag{Git/GitHub}
\cvtag{LaTeX}
\cvtag{Org-mode}
\cvtag{HTML/CSS}

\divider

\cvsubsection{Educación}

\cvevent{Doctorado en Ciencias Matemáticas. Instituto de Matemáticas}{ UNAM}{ CDMX}{ Agosto 2020 - Presente}
\begin{itemize}
\item Título de tesis: Un estudio de Foliaciones Holomorfas en Variedades Kahler compactas.
\item Tutor: Alberto Verjovsky Santiago.
\end{itemize}

\divider

\cvevent{Maestrtía en Ciencias Matemáticas. Instituto de Matemáticas}{ UNAM}{ CDMX}{ Agosto 2016 - Marzo 2019}
\begin{itemize}
\item Título de tesis: Estructuras proyectivas con holonomía fuchsiana.
\item Tutores: Adolfo Guillot Santiago y Antonio Lascurain Orive.
\end{itemize}

\divider

\cvevent{Licenciatura en Matemáticas (con mención honorífica)}{ Facultad de Ciencias}{ UNAM}{ CDMX}
\begin{itemize}
\item Título de tesis: Restricciones universales para grupos fuchsianos.
\item Asesor: Antonio Lascurain Orive.
\end{itemize}

\divider

\vspace{1cm}
\cvsubsection{Becas}
\begin{itemize}
\item 2016-2018: Beca Nacional para Maestría en Ciencias Matemáticas - Consejo Nacional de Ciencia y Tecnología (CONACyT).
\item 2020-2024: Beca Nacional para Doctorado en Ciencias Matemáticas - Consejo Nacional de Ciencia y Tecnología (CONACyT).
\end{itemize}

\cvsubsection{Premios}
\cvachievement{\faTrophy}{Medalla Gabino Barreda}{ Universidad Nacional Autónoma de México (UNAM)}{ Ciudad de México}

\cvsubsection{Idiomas}
\begin{itemize}
\item Español, nativo
\item Inglés, fluido (Puntuación TOEFL iBT: 96)
\item Francés, intermedio
\item Japonés, básico
\end{itemize}


\end{paracol}
\end{document}
\end{document}